const characters = {
	a: {
		h: 'あ',
		k: 'ア',
		r: 'a',
		c: 'a'
	},
	i: {
		h: 'い',
		k: 'イ',
		r: 'i',
		c: 'i'
	},
	u: {
		h: 'う',
		k: 'ウ',
		r: 'u',
		c: 'u'
	},
	e: {
		h: 'え',
		k: 'エ',
		r: 'e',
		c: 'e'
	},
	o: {
		h: 'お',
		k: 'オ',
		r: 'o',
		c: 'o'
	},
	ka: {
		h: 'か',
		k: 'カ',
		r: 'k',
		c: 'a'
	},
	ki: {
		h: 'き',
		k: 'キ',
		r: 'k',
		c: 'i'
	},
	ku: {
		h: 'く',
		k: 'ク',
		r: 'k',
		c: 'u'
	},
	ke: {
		h: 'け',
		k: 'ケ',
		r: 'k',
		c: 'e'
	},
	ko: {
		h: 'こ',
		k: 'コ',
		r: 'k',
		c: 'o'
	},
	sa: {
		h: 'さ',
		k: 'サ',
		r: 's',
		c: 'a'
	},
	shi: {
		h: 'し',
		k: 'シ',
		r: 's',
		c: 'i'
	},
	su: {
		h: 'す',
		k: 'ス',
		r: 's',
		c: 'u'
	},
	se: {
		h: 'せ',
		k: 'セ',
		r: 's',
		c: 'e'
	},
	so: {
		h: 'そ',
		k: 'ソ',
		r: 's',
		c: 'o'
	},
	ta: {
		h: 'た',
		k: 'タ',
		r: 't',
		c: 'a'
	},
	chi: {
		h: 'ち',
		k: 'チ',
		r: 't',
		c: 'i'
	},
	tsu: {
		h: 'つ',
		k: 'ツ',
		r: 't',
		c: 'u'
	},
	te: {
		h: 'て',
		k: 'テ',
		r: 't',
		c: 'e'
	},
	to: {
		h: 'と',
		k: 'ト',
		r: 't',
		c: 'o'
	},
	na: {
		h: 'な',
		k: 'ナ',
		r: 'n',
		c: 'a'
	},
	ni: {
		h: 'に',
		k: 'ニ',
		r: 'n',
		c: 'i'
	},
	nu: {
		h: 'ぬ',
		k: 'ヌ',
		r: 'n',
		c: 'u'
	},
	ne: {
		h: 'ね',
		k: 'ネ',
		r: 'n',
		c: 'e'
	},
	no: {
		h: 'の',
		k: 'ノ',
		r: 'n',
		c: 'o'
	},
	ha: {
		h: 'は',
		k: 'ハ',
		r: 'h',
		c: 'a'
	},
	hi: {
		h: 'ひ',
		k: 'ヒ',
		r: 'h',
		c: 'i'
	},
	fu: {
		h: 'ふ',
		k: 'フ',
		r: 'h',
		c: 'u'
	},
	he: {
		h: 'へ',
		k: 'ヘ',
		r: 'h',
		c: 'e'
	},
	ho: {
		h: 'ほ',
		k: 'ホ',
		r: 'h',
		c: 'o'
	},
	ma: {
		h: 'ま',
		k: 'マ',
		r: 'm',
		c: 'a'
	},
	mi: {
		h: 'み',
		k: 'ミ',
		r: 'm',
		c: 'i'
	},
	mu: {
		h: 'む',
		k: 'ム',
		r: 'm',
		c: 'u'
	},
	me: {
		h: 'め',
		k: 'メ',
		r: 'm',
		c: 'e'
	},
	mo: {
		h: 'も',
		k: 'モ',
		r: 'm',
		c: 'o'
	},
	ya: {
		h: 'や',
		k: 'ヤ',
		r: 'y',
		c: 'a'
	},
	yu: {
		h: 'ゆ',
		k: 'ユ',
		r: 'y',
		c: 'u'
	},
	yo: {
		h: 'よ',
		k: 'ヨ',
		r: 'y',
		c: 'o'
	},
	ra: {
		h: 'ら',
		k: 'ラ',
		r: 'r',
		c: 'a'
	},
	ri: {
		h: 'り',
		k: 'リ',
		r: 'r',
		c: 'i'
	},
	ru: {
		h: 'る',
		k: 'ル',
		r: 'r',
		c: 'u'
	},
	re: {
		h: 'れ',
		k: 'レ',
		r: 'r',
		c: 'e'
	},
	ro: {
		h: 'ろ',
		k: 'ロ',
		r: 'r',
		c: 'o'
	},
	wa: {
		h: 'わ',
		k: 'ワ',
		r: 'w',
		c: 'a'
	},
	wa: {
		h: 'わ',
		k: 'ワ',
		r: 'w',
		c: 'a'
	},
	wo: {
		h: 'を',
		k: 'ヲ',
		r: 'w',
		c: 'o'
	},
	n: {
		h: 'ん',
		k: 'ン',
		r: 'n',
		c: 'n'
	}
};

export default characters;